In [5]:
import pandas as pd
import datetime

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [37]:
cast.title.value_counts()

Around the World in Eighty Days       1298
7 cajas                                689
Thelma                                 580
The Ten Commandments                   533
The Eschatrilogy: Book of the Dead     517
                                      ...
A Box of Faith                           1
Reina y Rey                              1
Roots                                    1
Belum cukup umur                         1
El naddara el sawdaa                     1
Name: title, Length: 173458, dtype: int64

In [41]:
release_dates = pd.read_csv('release_dates.csv', index_col=None,
                                      parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

In [45]:
release_dates['month'] = pd.DatetimeIndex(release_dates.date).month
release_dates['day'] = pd.DatetimeIndex(release_dates.date).day
release_dates['decade'] = release_dates.year//10 * 10
release_dates.head()

                    title  year      country       date  month  day  decade
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15      6   15    2000
1                 #Beings  2015      Romania 2015-01-29      1   29    2010
2               #Declimax  2018  Netherlands 2018-01-21      1   21    2010
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21      1   21    2010
4                 #Horror  2015          USA 2015-11-20     11   20    2010

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [10]:
fil = (release_dates.title.str.contains('Christmas')) & (release_dates['country'] == 'USA')
release_dates[fil].groupby('month').year.count()

month
1      2
2      2
4      1
5      1
6      1
7      1
8      2
9      2
10    14
11    38
12    47
Name: year, dtype: int64

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

In [11]:
fil = (release_dates.title.str.contains('Christmas')) & (release_dates['country'] == 'Canada')
release_dates[fil].groupby('month').year.count()

month
10    2
11    9
12    6
Name: year, dtype: int64

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

In [13]:
fil = (release_dates.title.str.startswith('The Hobbit')) & (release_dates['country'] == 'USA')
release_dates[fil].groupby('month').year.count()

month
12    3
Name: year, dtype: int64

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

In [16]:
fil = (release_dates.title.str.contains('Romance')) & (release_dates['country'] == 'USA')
release_dates[fil].groupby('day').year.count()

day
1     10
2      1
3      3
4      4
5      2
6      3
7      1
8      1
9      8
10     5
11     6
12     3
13     5
14     3
15     7
16     2
17     6
18     2
19     2
20     2
21     2
22     2
23     2
24     4
25     2
26     3
27     1
28     1
29     2
30     4
31     1
Name: year, dtype: int64

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

In [17]:
fil = (release_dates.title.str.contains('Action')) & (release_dates['country'] == 'USA')
release_dates[fil].groupby('day').year.count()

day
1     2
3     2
7     1
8     3
12    3
13    2
14    2
15    1
16    1
18    1
20    3
22    2
25    1
28    1
29    3
30    2
31    1
Name: year, dtype: int64

In [42]:
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [43]:
USA = release_dates[release_dates.country == 'USA']
c= cast
c = c[c.name == 'Judi Dench']
c = c[c.year // 10 * 10 == 1990]
c.merge(USA).sort_values('date')

,title,year,name,type,character,n,country,date
0,GoldenEye,1995,Judi Dench,actress,M,6.0,USA,1995-11-17
2,Jack & Sarah,1995,Judi Dench,actress,Margaret,3.0,USA,1996-03-22
1,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
3,Mrs Brown,1997,Judi Dench,actress,Queen Victoria,1.0,USA,1997-10-03
7,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0,USA,1997-12-19
4,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0,USA,1999-01-08
5,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
6,The World Is Not Enough,1999,Judi Dench,actress,M,6.0,USA,1999-11-19

### In which months do films with the actress Judi Dench tend to be released in the USA?

In [47]:
USA = release_dates[release_dates.country == 'USA']
c= cast
c = c[c.name == 'Judi Dench']

judi = c.merge(USA).sort_values('date')

In [49]:
judi.groupby('month').month.count()

month
1      4
2      4
3      3
4      2
5      4
6      3
7      1
8      1
9      2
10     1
11    12
12     4
Name: month, dtype: int64

### In which months do films with the actor Tom Cruise tend to be released in the USA?

In [53]:
USA = release_dates[release_dates.country == 'USA']
c = cast[cast.name == 'Tom Cruise']
tom = c.merge(USA).groupby('month').month.count()
tom

month
1      2
3      1
4      3
5      5
6      8
7      7
8      3
9      1
10     3
11     3
12    10
Name: month, dtype: int64